"""
#################################################################################
1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
наприклад:
st = 'as 23 fdfdg544' введена строка
2,3,5,4,4        #вивело в консолі.
#################################################################################
"""
# st = 'as 23 fdfdg544'
#
# result = ''
# for ch in st:
#     if ch.isdecimal():
#         result += ch
# result = ', '.join(result)
# print(result)
"""
#################################################################################
2)написати прогу яка вибирає зі введеної строки числа і виводить їх 
так як вони написані
наприклад:
  st = 'as 23 fdfdg544 34' #введена строка
  23, 544, 34              #вивело в консолі
#################################################################################
"""
# st = 'as 23 fdfdg544 34 34 !!!1!!'
# result = ''
# for ch in st:
#     if ch.isdecimal():
#         result += ch
#     else:
#         result += " "
# result = ', '.join(result.split())
# print(result)
"""
#################################################################################
3)прога, що виводить кількість кожного символа з введеної строки,
наприклад:
st = 'as 23 fdfdg544' #введена строка
'a' -> 1  #вивело в консолі
's' -> 1
' ' -> 2
'2' -> 1
'3' -> 1
'f' -> 2
'd' -> 2
'g' -> 1
'5' -> 1
'4' -> 2
#################################################################################
"""
# st = 'as 23 fdfdg544'
# for ch in st:
#     count = st.count(ch)
#     if count:
#         print(f"'{ch}' -> {count}")
#         st = st.replace(ch, '')




# дз 2 часть(list comprehension):
"""
#################################################################################
1)есть строка:
greeting = 'Hello, world'
записать каждый символ в лист поменяв его на верхний регистр
пример:
['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
#################################################################################
"""
# greeting = 'Hello, world'
#
# chars = [item.upper() for item in greeting]
# print(chars)
"""
#################################################################################
2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
пример:
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
#################################################################################
"""
# print('____________________________________________')
# numbers = [number ** 2 for number in range(50) if number % 2 != 0]
# print(numbers)
"""
#################################################################################
3)  есть лист:
numbers = [1, 2, 3, 4, 5, 6, 7, 8]
создать новый лист и записать в него 'GT' если элемент в numbers больше 4 и 'LT' если элемент меньше или равен 4
пример:
['LT', 'LT', 'LT', 'LT', 'GT', 'GT', 'GT', 'GT']
#################################################################################
"""
# numbers = [1, 2, 3, 4, 5, 6, 7, 8]
#
# result = ['GT' if x > 4 else 'LT' for x in numbers]
# print(result)
"""
#################################################################################
4) есть два листа:
list1 = [1, 2, 3, 4, 5]
list2 = [-1, 7, 10, -5, -2]
записать в лист тюплы (x,y) если x+y == 0
пример:
[(1, -1), (2, -2), (5, -5)]
#################################################################################
"""
# list1 = [1, 2, 3, 4, 5]
# list2 = [-1, 7, 10, -5, -2]
#
# res = [(x, y) for x in list1 for y in list2 if x + y == 0]
#
# print(res)
